# 抽水機ID對應表
PUMP_MAPPING = {
        "A1": {
            "id": "北市-09",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市士林區延平北路7段106巷358號",
            "town": "士林區"
        },
        "A5": {
            "id": "104-L01",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A6": {
            "id": "104-L02",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A9": {
            "id": "105-L03",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A10": {
            "id": "105-L04",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A11": {
            "id": "105-L05",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市龜山區復興三路247巷30號",
            "town": "龜山區"
        },
        "A12": {
            "id": "105-L06",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A13": {
            "id": "105-L07",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A14": {
            "id": "105-L08",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市龜山區復興三路247巷30號",
            "town": "龜山區"
        },
        "A15": {
            "id": "105-L09",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A101": {
            "id": "99-M01",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A102": {
            "id": "99-M02",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A103": {
            "id": "99-M03",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A104": {
            "id": "99-M04",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A106": { # 注意：PHP 程式碼中 A106 在 A105 之前
            "id": "99-M05",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A105": {
            "id": "99-M06",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A107": {
            "id": "99-M07",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A108": {
            "id": "99-M08",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A109": {
            "id": "99-M09",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A110": {
            "id": "99-M10",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A111": {
            "id": "99-M11",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A115": { # 注意：PHP 程式碼中 A115 在 A113 之前
            "id": "99-M15",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A113": {
            "id": "99-M13",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A114": {
            "id": "99-M14",
            "city": "桃園市",
            "org": "61",
            "org_name": "桃園市政府",
            "road": "桃園市政府水務局防汛場",
            "town": ""
        },
        "A17": {
            "id": "花蓮縣-01",
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣花蓮市國盛七街1號",
            "town": "花蓮市"
        },
        "A18": {
            "id": "花蓮縣-02",
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣吉安鄉南濱路一段531號",
            "town": "吉安鄉"
        },
        "A19": {
            "id": "吉安鄉-03", # PHP 註解為 "花蓮縣-03"
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣吉安鄉中山路三段953巷2號",
            "town": "吉安鄉"
        },
        "A20": {
            "id": "吉安鄉-04", # PHP 註解為 "花蓮縣-04"
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣吉安鄉中山路三段953巷2號",
            "town": "吉安鄉"
        },
        "A21": {
            "id": "花蓮縣-05",
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣吉安鄉中山路三段953巷2號",
            "town": "吉安鄉"
        },
        "A22": {
            "id": "花蓮縣-06",
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣鳳林鎮榮開路70號",
            "town": "鳳林鎮"
        },
        "A23": {
            "id": "花蓮縣-07",
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣鳳林鎮榮開路70號",
            "town": "鳳林鎮"
        },
        "A24": {
            "id": "花蓮縣-08",
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣玉里鎮清潔隊",
            "town": "玉里鎮"
        },
        "A25": {
            "id": "花蓮縣-09",
            "city": "花蓮縣",
            "org": "66",
            "org_name": "花蓮縣政府",
            "road": "花蓮縣玉里鎮清潔隊",
            "town": "玉里鎮"
        },
        "A33": {
            "id": "北市-01",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市中山區濱江街97號",
            "town": "中山區"
        },
        "A34": {
            "id": "北市-02",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市中山區濱江街97號",
            "town": "中山區"
        },
        "A35": {
            "id": "北市-03",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市士林區中山北路6段2巷1號",
            "town": "士林區"
        },
        "A36": {
            "id": "北市-04",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市士林區中山北路6段2巷1號",
            "town": "士林區"
        },
        "A37": {
            "id": "北市-05",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市士林區中山北路6段2巷1號",
            "town": "士林區"
        },
        "A38": {
            "id": "北市-06",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市中山區濱江街97號",
            "town": "中山區"
        },
        "A39": {
            "id": "北市-07",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市士林區中山北路6段2巷1號",
            "town": "士林區"
        },
        "A40": {
            "id": "北市-08",
            "city": "台北市",
            "org": "68",
            "org_name": "臺北市政府",
            "road": "臺北市中山區濱江街97號",
            "town": "中山區"
        },
        "A84": {
            "id": "新竹縣-01",
            "city": "新竹縣",
            "org": "63",
            "org_name": "新竹縣政府",
            "road": "桃竹苗水情中心",
            "town": "竹北市"
        },
        "A85": {
            "id": "新竹縣-02",
            "city": "新竹縣",
            "org": "63",
            "org_name": "新竹縣政府",
            "road": "桃竹苗水情中心",
            "town": "竹北市"
        },
        "A86": {
            "id": "苗栗縣-04",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A87": {
            "id": "苗栗縣-05",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A88": {
            "id": "苗栗縣-06",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A89": {
            "id": "苗栗縣-07",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A90": {
            "id": "苗栗縣-08",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A91": {
            "id": "苗栗縣-09",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A92": {
            "id": "頭份鎮-01",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A93": {
            "id": "頭份鎮-02",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A94": {
            "id": "頭份鎮-03",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A95": {
            "id": "頭份鎮-04",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A96": {
            "id": "頭份鎮-05",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A97": {
            "id": "頭份鎮-06",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A98": {
            "id": "頭份鎮-07",
            "city": "苗栗縣",
            "org": "63",
            "org_name": "苗栗縣政府",
            "road": "苗栗市經國路四段867號",
            "town": "苗栗市"
        },
        "A116": {
            "id": "南投縣-01",
            "city": "南投縣",
            "org": "64",
            "org_name": "南投縣南投市清潔隊",
            "road": "南投縣南投市嶺興路36號",
            "town": "南投縣"
        },
        "A117": {
            "id": "南投縣-02",
            "city": "南投縣",
            "org": "64",
            "org_name": "南投縣南投市清潔隊",
            "road": "南投縣南投市嶺興路36號",
            "town": "南投縣"
        },
        "A118": {
            "id": "南投縣-03",
            "city": "南投縣",
            "org": "64",
            "org_name": "南投縣南投市軍功橋",
            "road": "南投縣南投市軍功橋",
            "town": "南投縣"
        },
}

# 狀態代碼映射
STATUS_MAPPING = {
    "0": "離線",
    "1": "待命",
    "2": "運送中",
    "3": "抽水中",
    "4": "故障",
    "5": "油位低電壓"
}